## WEEK 05
## Encounter - Data Modeling
## 'movielens' data profiling

### 1. Tags

In [1]:
import pandas as pd

In [2]:
tags = pd.read_csv('../data/tags.csv')
tags

      userId  movieId               tag   timestamp
0          2    60756             funny  1445714994
1          2    60756   Highly quotable  1445714996
2          2    60756      will ferrell  1445714992
3          2    89774      Boxing story  1445715207
4          2    89774               MMA  1445715200
...      ...      ...               ...         ...
3675     606     7382         for katie  1171234019
3676     606     7936           austere  1173392334
3677     610     3265            gun fu  1493843984
3678     610     3265  heroic bloodshed  1493843978
3679     610   168248  Heroic Bloodshed  1493844270

[3680 rows x 4 columns]

In [3]:
tags.isnull().sum()

userId       0
movieId      0
tag          0
timestamp    0
dtype: int64

In [4]:
tags.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3680 entries, 0 to 3679
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   userId     3680 non-null   int64
 1   movieId    3680 non-null   int64
 2   tag        3680 non-null   object
 3   timestamp  3680 non-null   int64
dtypes: int64(3), object(1)
memory usage: 115.1+ KB

In [5]:
tags_dups = tags.groupby(by=['userId', 'movieId','tag']).count()
tags_dups

                                 timestamp
userId movieId tag
2      60756   Highly quotable           1
               funny                     1
               will ferrell              1
       89774   Boxing story              1
               MMA                       1
...                                    ...
606    7382    for katie                 1
       7936    austere                   1
610    3265    gun fu                    1
               heroic bloodshed          1
       168248  Heroic Bloodshed          1

[3680 rows x 1 columns]

In [6]:
# test if ('userId', 'movieId', 'tag') is PK for 'Tags' dataset
# (defines a record uniquly)
tags_dups['timestamp'].nunique()

# Answer is 'YES' as we have only 1 record (count()) for each combination under groupby()

1

In [7]:
tags.columns

Index(['userId', 'movieId', 'tag', 'timestamp'], dtype='object')

In [8]:
tags.describe()

            userId        movieId     timestamp
count  3680.000000    3680.000000  3.680000e+03
mean    431.038587   27146.562772  1.319865e+09
std     158.489644   43351.076604  1.720727e+08
min       2.000000       1.000000  1.137179e+09
25%     424.000000    1261.500000  1.137521e+09
50%     474.000000    4451.000000  1.269833e+09
75%     477.000000   38973.000000  1.498457e+09
max     610.000000  193565.000000  1.537099e+09

In [9]:
tag_len = tags['tag'].str.len()
tag_len.max()

85

In [10]:
# checking for alternate PK
tags_pk = tags.groupby(by=['userId', 'movieId','timestamp']).count()
tags_pk

                           tag
userId movieId timestamp
2      60756   1445714992    1
               1445714994    1
               1445714996    1
       89774   1445715200    1
               1445715205    1
...                        ...
606    7382    1171234019    1
       7936    1173392334    1
610    3265    1493843978    1
               1493843984    1
       168248  1493844270    1

[3420 rows x 1 columns]

In [11]:
tags_pk['tag'].nunique()

5

In [12]:
tags_pk['tag'].unique()
# it means that combination ('userId', 'movieId','timestamp') could n ot be used as a PK

array([1, 2, 3, 4, 5], dtype=int64)

### 2. Links

In [13]:
links = pd.read_csv('../data/links.csv')
links

      movieId   imdbId  tmdbId
0           1   114709     862
1           2   113497    8844
2           3   113228   15602
3           4   114885   31357
4           5   113041   11862
...       ...      ...     ...
9717   193581  5476944  432131
9718   193583  5914996  445030
9719   193585  6397426  479308
9720   193587  8391976  483455
9721   193609   101726   37891

[9722 rows x 3 columns]

In [14]:
# checking for NULLs
links.isnull().sum()
# No NULLs

movieId    0
imdbId     0
tmdbId     0
dtype: int64

In [15]:
# data types for columns
links.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9722 entries, 0 to 9721
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9722 non-null   int64
 1   imdbId   9722 non-null   int64
 2   tmdbId   9722 non-null   int64
dtypes: int64(3)
memory usage: 228.0 KB

In [16]:
# min and max values
links.describe()

             movieId        imdbId         tmdbId
count    9722.000000  9.722000e+03    9722.000000
mean    42069.219914  6.741402e+05   54769.048035
std     52037.308455  1.101341e+06   92989.237112
min         1.000000  4.170000e+02       2.000000
25%      3246.250000  9.517525e+04    9662.250000
50%      7283.500000  1.669515e+05   16463.500000
75%     76048.000000  8.041198e+05   44036.500000
max    193609.000000  8.391976e+06  525662.000000

In [17]:
# checking if 'movie_id' is a PK
links['movieId'].nunique()
# the same as total -> is a PK

9722

In [18]:
links.columns

Index(['movieId', 'imdbId', 'tmdbId'], dtype='object')

In [19]:
# checking if 'imdbId' is unique
links['imdbId'].nunique()
# YES

9722

In [20]:
# checking if 'tmdbId' is unique
links['tmdbId'].nunique()
# NO!!

9721

In [21]:
# tmdbId dup:
links_dups = links.groupby(by='tmdbId').count()
mask = links_dups['movieId'] > 1
links_dups[mask]

        movieId  imdbId
tmdbId
4912          2       2

### 3. Movies

In [22]:
movies = pd.read_csv('../data/movies.csv')
movies

,movieId,title,genres,year
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men,Comedy|Romance,1995
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II,Comedy,1995
...,...,...,...,...
9724,193581,Black Butler: Book of the Atlantic,Action|Animation|Comedy|Fantasy,2017
9725,193583,No Game No Life: Zero,Animation|Comedy|Fantasy,2017
9726,193585,Flint,Drama,2017
9727,193587,Bungo Stray Dogs: Dead Apple,Action|Animation,2018
9728,193609,Andrew Dice Clay: Dice Rules,Comedy,1991

In [23]:
# checking for NULLs
movies.isnull().sum()
# no NULLs

movieId    0
title      0
genres     0
year       0
dtype: int64

In [40]:
# checking data types
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9729 entries, 0 to 9728
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9729 non-null   int64
 1   title    9729 non-null   object
 2   genres   9729 non-null   object
 3   year     9729 non-null   int64
dtypes: int64(2), object(2)
memory usage: 304.2+ KB

In [25]:
# getting min and max numeric values
movies.describe()
#movies.describe(include='O')

            movieId         year
count    9729.00000  9729.000000
mean    42054.09004  1994.613629
std     52026.56424    18.535219
min         1.00000  1902.000000
25%      3244.00000  1988.000000
50%      7282.00000  1999.000000
75%     76030.00000  2008.000000
max    193609.00000  2018.000000

In [26]:
movies.columns

Index(['movieId', 'title', 'genres', 'year'], dtype='object')

In [27]:
# max length of 'title' values
title_len = movies['title'].str.len()
title_len.max()

152

In [28]:
# max length of 'title' values
genres_len = movies['genres'].str.len()
genres_len.max()

77

In [29]:
# getting PK (movieId)
movies['movieId'].nunique()
# the same as total -> 'movieId' is a PK!

9729

In [30]:
# checking if 'title' is also unique
movies['title'].nunique()
# not at all

9448

In [31]:
# subset of films with the same titles
movies_dups = movies.groupby(by='title').count()
#movies_dups
mask_movies = movies_dups['movieId'] > 1
movies_dups[mask_movies][['movieId']]

                               movieId
title
12 Angry Men                         2
12 Chairs                            2
20,000 Leagues Under the Sea         2
3:10 to Yuma                         2
Alfie                                2
...                                ...
Wonderland                           2
Wuthering Heights                    2
Yours, Mine and Ours                 2
Zoom                                 2
Zulu                                 2

[255 rows x 1 columns]

In [32]:
# unique genres?
# TBD

### 4. Ratings

In [33]:
ratings = pd.read_csv('../data/ratings.csv')
ratings

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100813     610   166534     4.0  1493848402
100814     610   168248     5.0  1493850091
100815     610   168250     5.0  1494273047
100816     610   168252     5.0  1493846352
100817     610   170875     3.0  1493846415

[100818 rows x 4 columns]

In [34]:
# checking for NULLs
ratings.isnull().sum()
# no NULLs

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [35]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100818 entries, 0 to 100817
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100818 non-null  int64
 1   movieId    100818 non-null  int64
 2   rating     100818 non-null  float64
 3   timestamp  100818 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [36]:
ratings.describe()

              userId        movieId         rating     timestamp
count  100818.000000  100818.000000  100818.000000  1.008180e+05
mean      326.128717   19412.910552       3.501532  1.205892e+09
std       182.620110   35490.816132       1.042469  2.162414e+08
min         1.000000       1.000000       0.500000  8.281246e+08
25%       177.000000    1199.000000       3.000000  1.018665e+09
50%       325.000000    2991.000000       3.500000  1.186087e+09
75%       477.000000    8044.000000       4.000000  1.435994e+09
max       610.000000  193609.000000       5.000000  1.537799e+09

In [37]:
# how many decimals has float 'rating'
ratings['rating_str'] = ratings['rating'].astype(object)
ratings

        userId  movieId  rating   timestamp rating_str
0            1        1     4.0   964982703        4.0
1            1        3     4.0   964981247        4.0
2            1        6     4.0   964982224        4.0
3            1       47     5.0   964983815        5.0
4            1       50     5.0   964982931        5.0
...        ...      ...     ...         ...        ...
100813     610   166534     4.0  1493848402        4.0
100814     610   168248     5.0  1493850091        5.0
100815     610   168250     5.0  1494273047        5.0
100816     610   168252     5.0  1493846352        5.0
100817     610   170875     3.0  1493846415        3.0

[100818 rows x 5 columns]

In [38]:
# 
ratings.info()

#ratings_len = ratings['rating_str'].str.len()
#ratings_len.max()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100818 entries, 0 to 100817
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   userId      100818 non-null  int64
 1   movieId     100818 non-null  int64
 2   rating      100818 non-null  float64
 3   timestamp   100818 non-null  int64
 4   rating_str  100818 non-null  object
dtypes: float64(1), int64(3), object(1)
memory usage: 3.8+ MB

In [54]:
# Primary Key for 'ratings'
# are there any users who gave a few ratings for the same movie? NO
# userId+movieId are suuposed to be PK
# TRUE
ratings_pk = ratings.groupby(by=['userId', 'movieId']).count()
ratings_pk

ratings_mask = ratings_pk['rating'] > 1
ratings_pk[ratings_mask][['rating']]

Empty DataFrame
Columns: [rating]
Index: []

In [51]:
# list of unique values gives us NUMBER OF DECIMALS!
ratings['rating_str'].unique()

array([4.0, 5.0, 3.0, 2.0, 1.0, 4.5, 3.5, 2.5, 0.5, 1.5], dtype=object)

In [39]:
# gives error
ratings_len = ratings['rating_str'].str.len()
ratings_len.max()

AttributeError: Can only use .str accessor with string values!

Links:
    movieId,imdbId,tmdbId
    1,114709,862

Movies:
    movieId,title,genres,year
    1,Toy Story ,Adventure|Animation|Children|Comedy|Fantasy,1995

Ratings:
    userId,movieId,rating,timestamp
    1,1,4.0,964982703